# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# import
import sys
import os

# パス対策（絶対パスを追加。これはinstaller/src/main.pyにいる場合！）
#../../ に変えて1階層減らす（installer/から見たルートにする）ここを修正。
sys.path.insert(0, os.path.abspath(os.path.join(os.path.dirname(__file__), "../..")))
from installer.src.flow.base.chrome import Chrome
# 相対パスimport
#from .flow.base.chrome import Chrome
# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$

# ----------------------------------------------------------------------------------
# **********************************************************************************

def main():
    driver = Chrome.get_driver()
    driver.get("https://www.google.com")
    input("Chromeが起動してGoogleが開いたら何かキーを押してください: ")
    driver.quit()

# **********************************************************************************

if __name__ == "__main__":
    main()

# ----------------------------------------------------------------------------------

